Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
/**
 ******************************************************************************
 * @file    bl702_sec_eng.c
 * @version V1.0
 * @date
 * @brief   This file is the standard driver c file
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

#include "bl702_sec_eng.h"
#include "string.h"

/** @addtogroup  BL702_Peripheral_Driver
 *  @{
 */

/** @addtogroup  SEC_ENG
 *  @{
 */

/** @defgroup  SEC_ENG_Private_Macros
 *  @{
 */
#define PUT_UINT32_BE(n, b, i)           \
  {                                      \
    (b)[(i)]     = (uint8_t)((n) >> 24); \
    (b)[(i) + 1] = (uint8_t)((n) >> 16); \
    (b)[(i) + 2] = (uint8_t)((n) >> 8);  \
    (b)[(i) + 3] = (uint8_t)((n));       \
  }
#define PUT_UINT64_BE(n, b, i)           \
  {                                      \
    (b)[(i)]     = (uint8_t)((n) >> 56); \
    (b)[(i) + 1] = (uint8_t)((n) >> 48); \
    (b)[(i) + 2] = (uint8_t)((n) >> 40); \
    (b)[(i) + 3] = (uint8_t)((n) >> 32); \
    (b)[(i) + 4] = (uint8_t)((n) >> 24); \
    (b)[(i) + 5] = (uint8_t)((n) >> 16); \
    (b)[(i) + 6] = (uint8_t)((n) >> 8);  \
    (b)[(i) + 7] = (uint8_t)((n));       \
  }
#define SEC_ENG_SHA_BUSY_TIMEOUT_COUNT  (100 * 160 * 1000)
#define SEC_ENG_AES_BUSY_TIMEOUT_COUNT  (100 * 160 * 1000)
#define SEC_ENG_TRNG_BUSY_TIMEOUT_COUNT (100 * 160 * 1000)
#define SEC_ENG_PKA_INT_TIMEOUT_COUNT   (100 * 160 * 1000)
#define SEC_ENG_GMAC_BUSY_TIMEOUT_COUNT (100 * 160 * 1000)

/*@} end of group SEC_ENG_Private_Macros */

/** @defgroup  SEC_ENG_Private_Types
 *  @{
 */
struct pka0_pld_cfg {
  union {
    struct {
      uint32_t size : 12;       /*[11: 0],       r/w,        0x0 */
      uint32_t d_reg_index : 8; /*[19:12],        r/w,        0x0 */
      uint32_t d_reg_type : 4;  /*[23:20],        r/w,        0x0 */
      uint32_t op : 7;          /*[30:24],        r/w,        0x0 */
      uint32_t last_op : 1;     /*[31:31],        r/w,        0x0 */
    } BF;
    uint32_t WORD;
  } value;
};

struct pka0_pldi_cfg {
  union {
    struct {
      uint32_t rsvd : 12;       /*[11: 0],       r/w,        0x0 */
      uint32_t d_reg_index : 8; /*[19:12],        r/w,        0x0 */
      uint32_t d_reg_type : 4;  /*[23:20],        r/w,        0x0 */
      uint32_t op : 7;          /*[30:24],        r/w,        0x0 */
      uint32_t last_op : 1;     /*[31:31],        r/w,        0x0 */
    } BF;
    uint32_t WORD;
  } value;
};

struct pka0_common_op_first_cfg {
  union {
    struct {
      uint32_t s0_reg_idx : 8;  /*[7: 0],       r/w,        0x0 */
      uint32_t s0_reg_type : 4; /*[11:8],       r/w,        0x0 */
      uint32_t d_reg_idx : 8;   /*[19:12],      r/w,        0x0 */
      uint32_t d_reg_type : 4;  /*[23:20],      r/w,        0x0 */
      uint32_t op : 7;          /*[30:24],      r/w,        0x0 */
      uint32_t last_op : 1;     /*[31:31],      r/w,        0x0 */
    } BF;
    uint32_t WORD;
  } value;
};

struct pka0_common_op_snd_cfg_S1_only {
  union {
    struct {
      uint32_t reserved_0_11 : 12; /*[11: 0],       rsvd,       0x0 */
      uint32_t s1_reg_idx : 8;     /*[19:12],       r/w,        0x0 */
      uint32_t s1_reg_type : 4;    /*[23:20],       r/w,        0x0 */
      uint32_t reserved_24_31 : 8; /*[31:24],       rsvd,       0x0 */
    } BF;
    uint32_t WORD;
  } value;
};

struct pka0_common_op_snd_cfg_S2_only {
  union {
    struct {
      uint32_t s2_reg_idx : 8;      /*[7 : 0],       r/w,        0x0 */
      uint32_t s2_reg_type : 4;     /*[11: 8],       r/w,        0x0 */
      uint32_t reserved_12_31 : 20; /*[31:12],       rsvd,       0x0 */
    } BF;
    uint32_t WORD;
  } value;
};

struct pka0_common_op_snd_cfg_S1_S2 {
  union {
    struct {
      uint32_t s2_reg_idx : 8;     /*[7 : 0],       r/w,        0x0 */
      uint32_t s2_reg_type : 4;    /*[11: 8],       r/w,        0x0 */
      uint32_t s1_reg_idx : 8;     /*[19:12],       r/w,        0x0 */
      uint32_t s1_reg_type : 4;    /*[23:20],       r/w,        0x0 */
      uint32_t reserved_24_31 : 8; /*[31:24],       rsvd,       0x0 */
    } BF;
    uint32_t WORD;
  } value;
};

struct pka0_bit_shift_op_cfg {
  union {
    struct {
      uint32_t bit_shift : 15;      /*[14: 0],       r/w,        0x0 */
      uint32_t reserved_24_31 : 17; /*[31:15],       rsvd,        0x0 */
    } BF;
    uint32_t WORD;
  } value;
};

/*@} end of group SEC_ENG_Private_Types */

/** @defgroup  SEC_ENG_Private_Variables
 *  @{
 */
static intCallback_Type *secEngIntCbfArra[SEC_ENG_INT_ALL] = {NULL};

/*@} end of group SEC_ENG_Private_Variables */

