Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
/** @defgroup  SEC_ENG_Global_Variables
 *  @{
 */

/*@} end of group SEC_ENG_Global_Variables */

/** @defgroup  SEC_ENG_Private_Fun_Declaration
 *  @{
 */

/*@} end of group SEC_ENG_Private_Fun_Declaration */

/** @defgroup  SEC_ENG_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  SHA256 initialization function
                                                                                *
                                                                                * @param  shaCtx: SHA256 context pointer
                                                                                * @param  shaNo: SHA ID type
                                                                                * @param  shaType: SHA type
                                                                                * @param  shaTmpBuf[16]: SHA temp buffer for store data that is less than 64 bytes
                                                                                * @param  padding[16]: SHA padding buffer for store padding data
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_SHA256_Init(SEC_Eng_SHA256_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, SEC_ENG_SHA_Type shaType, uint32_t shaTmpBuf[16], uint32_t padding[16]) {
  uint32_t SHAx = SEC_ENG_BASE + SEC_ENG_SHA_OFFSET;
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));
  CHECK_PARAM(IS_SEC_ENG_SHA_TYPE(shaType));

  /* Deal SHA control register to set SHA mode */
  tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE, shaType);
  BL_WR_REG(SHAx, SEC_ENG_SE_SHA_CTRL, tmpVal);

  /* Clear context */
  memset(shaCtx, 0, sizeof(SEC_Eng_SHA256_Ctx));

  /* Init temp buffer and padding buffer */
  shaCtx->shaBuf     = shaTmpBuf;
  shaCtx->shaPadding = padding;
  BL702_MemSet(shaCtx->shaPadding, 0, 64);
  BL702_MemSet(shaCtx->shaPadding, 0x80, 1);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(SEC_SHA_IRQn, SEC_SHA_IRQHandler);
#endif
}

/****************************************************************************/ /**
                                                                                * @brief  SHA start function
                                                                                *
                                                                                * @param  shaNo: SHA ID type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_SHA_Start(SEC_ENG_SHA_ID_Type shaNo) {
  uint32_t SHAx = SEC_ENG_BASE + SEC_ENG_SHA_OFFSET;
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));

  /* Set SHA enable */
  tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);

  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_EN);
  /* Hash sel 0 for new start */
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_SHA_HASH_SEL);

  BL_WR_REG(SHAx, SEC_ENG_SE_SHA_CTRL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  SHA256 update input data function
                                                                                *
                                                                                * @param  shaCtx: SHA256 context pointer
                                                                                * @param  shaNo: SHA ID type
                                                                                * @param  input: SHA input data pointer, and the address should be word align
                                                                                * @param  len: SHA input data length
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type Sec_Eng_SHA256_Update(SEC_Eng_SHA256_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, const uint8_t *input, uint32_t len) {
  uint32_t SHAx = SEC_ENG_BASE + SEC_ENG_SHA_OFFSET;
  uint32_t tmpVal;
  uint32_t fill;
  uint32_t left;
  uint32_t timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

  if (len == 0) {
    return SUCCESS;
  }

  do {
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_BUSY));

  /* SHA need set se_sha_sel to 1 to keep the last SHA state */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_HASH_SEL, shaCtx->shaFeed);

  left = shaCtx->total[0] & 0x3F;
  fill = 64 - left;

  shaCtx->total[0] += (uint32_t)len;
  shaCtx->total[0] &= 0xFFFFFFFF;

  if (shaCtx->total[0] < (uint32_t)len) {
    shaCtx->total[1]++;
  }

  if (left && len >= fill) {
    BL702_MemCpy_Fast((void *)((uint8_t *)shaCtx->shaBuf + left), input, fill);
    /* Set data source address */
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_MSA, (uint32_t)shaCtx->shaBuf);

    /* Set data length */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MSG_LEN, 1);
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_CTRL, tmpVal);
    /* Trigger */
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_TRIG_1T);
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_CTRL, tmpVal);

    shaCtx->shaFeed = 1;
    input += fill;
    len -= fill;
    left = 0;
  }

  fill = len / 64;
  len  = len % 64;

  if (fill > 0) {
    /* Wait finished */
    timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    do {
      tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
      timeoutCnt--;

      if (timeoutCnt == 0) {
        return TIMEOUT;
      }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_BUSY));

