Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
    /* SHA need set se_sha_sel to 1 to keep the last sha state */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_HASH_SEL, shaCtx->shaFeed);

    /* Fill data */
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_MSA, (uint32_t)input);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MSG_LEN, fill);
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_CTRL, tmpVal);

    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_TRIG_1T);
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_CTRL, tmpVal);

    input += (fill * 64);
    shaCtx->shaFeed = 1;
  }

  if (len > 0) {
    /* Wait finished */
    timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    do {
      tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
      timeoutCnt--;

      if (timeoutCnt == 0) {
        return TIMEOUT;
      }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_BUSY));

    /* Copy left data into temp buffer */
    BL702_MemCpy_Fast((void *)((uint8_t *)shaCtx->shaBuf + left), input, len);
  }

  /* Wait finished */
  timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

  do {
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_BUSY));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SHA256 finish to get output function
                                                                                *
                                                                                * @param  shaCtx: SHA256 context pointer
                                                                                * @param  shaNo: SHA ID type
                                                                                * @param  hash: SHA output data of SHA result
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type Sec_Eng_SHA256_Finish(SEC_Eng_SHA256_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, uint8_t *hash) {
  uint32_t last, padn;
  uint32_t high, low;
  uint8_t  shaMode;
  uint8_t  msgLen[8];
  uint8_t *p    = (uint8_t *)hash;
  uint32_t SHAx = SEC_ENG_BASE + SEC_ENG_SHA_OFFSET;
  uint32_t tmpVal;
  uint32_t timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));

  /* Wait finished */
  do {
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_BUSY));

  high = (shaCtx->total[0] >> 29) | (shaCtx->total[1] << 3);
  low  = (shaCtx->total[0] << 3);

  PUT_UINT32_BE(high, msgLen, 0);
  PUT_UINT32_BE(low, msgLen, 4);

  last = shaCtx->total[0] & 0x3F;
  padn = (last < 56) ? (56 - last) : (120 - last);

  Sec_Eng_SHA256_Update(shaCtx, shaNo, (uint8_t *)shaCtx->shaPadding, padn);

  /* Wait for  shaPadding idle */
  timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

  do {
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_BUSY));

  BL702_MemCpy_Fast(shaCtx->shaPadding, msgLen, 8);
  Sec_Eng_SHA256_Update(shaCtx, shaNo, (uint8_t *)shaCtx->shaPadding, 8);

  /* Wait finished */
  timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

  do {
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_BUSY));

  tmpVal  = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
  shaMode = (SEC_ENG_SHA_Type)BL_GET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE);
  /* Copy SHA value */
  tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_0);
  *p++   = (tmpVal & 0xff);
  *p++   = ((tmpVal >> 8) & 0xff);
  *p++   = ((tmpVal >> 16) & 0xff);
  *p++   = ((tmpVal >> 24) & 0xff);
  tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_1);
  *p++   = (tmpVal & 0xff);
  *p++   = ((tmpVal >> 8) & 0xff);
  *p++   = ((tmpVal >> 16) & 0xff);
  *p++   = ((tmpVal >> 24) & 0xff);
  tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_2);
  *p++   = (tmpVal & 0xff);
  *p++   = ((tmpVal >> 8) & 0xff);
  *p++   = ((tmpVal >> 16) & 0xff);
  *p++   = ((tmpVal >> 24) & 0xff);
  tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_3);
  *p++   = (tmpVal & 0xff);
  *p++   = ((tmpVal >> 8) & 0xff);
  *p++   = ((tmpVal >> 16) & 0xff);
  *p++   = ((tmpVal >> 24) & 0xff);
  tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_4);
  *p++   = (tmpVal & 0xff);
  *p++   = ((tmpVal >> 8) & 0xff);
  *p++   = ((tmpVal >> 16) & 0xff);
  *p++   = ((tmpVal >> 24) & 0xff);

  if (shaMode == SEC_ENG_SHA224 || shaMode == SEC_ENG_SHA256) {
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_5);
    *p++   = (tmpVal & 0xff);
    *p++   = ((tmpVal >> 8) & 0xff);
    *p++   = ((tmpVal >> 16) & 0xff);
    *p++   = ((tmpVal >> 24) & 0xff);
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_6);
    *p++   = (tmpVal & 0xff);
    *p++   = ((tmpVal >> 8) & 0xff);
    *p++   = ((tmpVal >> 16) & 0xff);
    *p++   = ((tmpVal >> 24) & 0xff);

    if (shaMode == SEC_ENG_SHA256) {
      tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_7);
      *p++   = (tmpVal & 0xff);
      *p++   = ((tmpVal >> 8) & 0xff);
      *p++   = ((tmpVal >> 16) & 0xff);
      *p++   = ((tmpVal >> 24) & 0xff);
    }
  }

  /* Disable SHA engine*/
  tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_SHA_HASH_SEL);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_SHA_EN);
  BL_WR_REG(SHAx, SEC_ENG_SE_SHA_CTRL, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SHA enable link mode and set link config address
                                                                                *
                                                                                * @param  shaNo: SHA ID type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_SHA_Enable_Link(SEC_ENG_SHA_ID_Type shaNo) {
  uint32_t SHAx = SEC_ENG_BASE;
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));

  /* Enable sha and enable link mode */
  tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_EN);
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_LINK_MODE);
  BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  SHA disable link mode
                                                                                *
                                                                                * @param  shaNo: SHA ID type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_SHA_Disable_Link(SEC_ENG_SHA_ID_Type shaNo) {
  uint32_t SHAx = SEC_ENG_BASE;
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));

  /* Disable sha and disable link mode */
  tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_LINK_MODE);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_EN);
  BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  SHA256 link mode initialization function
                                                                                *
                                                                                * @param  shaCtx: SHA256 link mode context pointer
                                                                                * @param  shaNo: SHA ID type
                                                                                * @param  linkAddr: SHA link configure address
                                                                                * @param  shaTmpBuf[16]: SHA temp buffer for store data that is less than 64 bytes
                                                                                * @param  padding[16]: SHA padding buffer for store padding data
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_SHA256_Link_Init(SEC_Eng_SHA256_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, uint32_t linkAddr, uint32_t shaTmpBuf[16], uint32_t padding[16]) {
  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));

  /* Clear context */
  memset(shaCtx, 0, sizeof(SEC_Eng_SHA256_Link_Ctx));

  /* Init temp buffer,padding buffer and link address */
  shaCtx->shaBuf     = shaTmpBuf;
  shaCtx->shaPadding = padding;
  BL702_MemSet(shaCtx->shaPadding, 0, 64);
  BL702_MemSet(shaCtx->shaPadding, 0x80, 1);
  shaCtx->linkAddr = linkAddr;

