Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(SEC_SHA_IRQn, SEC_SHA_IRQHandler);
#endif
}

/****************************************************************************/ /**
                                                                                * @brief  SHA256 link mode update input data function
                                                                                *
                                                                                * @param  shaCtx: SHA256 link mode context pointer
                                                                                * @param  shaNo: SHA ID type
                                                                                * @param  input: SHA input data pointer, and the address should be word align
                                                                                * @param  len: SHA input data length
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type Sec_Eng_SHA256_Link_Update(SEC_Eng_SHA256_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, const uint8_t *input, uint32_t len) {
  uint32_t SHAx = SEC_ENG_BASE;
  uint32_t tmpVal;
  uint32_t fill;
  uint32_t left;
  uint32_t timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

  if (len == 0) {
    return SUCCESS;
  }

  do {
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

  /* Set link address */
  BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_LINK, shaCtx->linkAddr);

  left = shaCtx->total[0] & 0x3F;
  fill = 64 - left;

  shaCtx->total[0] += (uint32_t)len;
  shaCtx->total[0] &= 0xFFFFFFFF;

  if (shaCtx->total[0] < (uint32_t)len) {
    shaCtx->total[1]++;
  }

  if (left && len >= fill) {
    BL702_MemCpy_Fast((void *)((uint8_t *)shaCtx->shaBuf + left), input, fill);
    /* Set data source address */
    *(uint32_t *)(shaCtx->linkAddr + 4) = (uint32_t)shaCtx->shaBuf;

    /* Set data length */
    *((uint16_t *)shaCtx->linkAddr + 1) = 1;
    /* Trigger */
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_TRIG_1T));

    /* Choose accumulating last hash in the next time */
    *((uint32_t *)shaCtx->linkAddr) |= 0x40;
    input += fill;
    len -= fill;
    left = 0;
  }

  fill = len / 64;
  len  = len % 64;

  if (fill > 0) {
    /* Wait finished */
    timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    do {
      tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
      timeoutCnt--;

      if (timeoutCnt == 0) {
        return TIMEOUT;
      }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

    /* Fill data */
    *(uint32_t *)(shaCtx->linkAddr + 4) = (uint32_t)input;
    *((uint16_t *)shaCtx->linkAddr + 1) = fill;

    /* Trigger */
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_TRIG_1T));

    input += (fill * 64);
    /* Choose accumulating last hash in the next time */
    *((uint32_t *)shaCtx->linkAddr) |= 0x40;
  }

  if (len > 0) {
    /* Wait finished */
    timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    do {
      tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
      timeoutCnt--;

      if (timeoutCnt == 0) {
        return TIMEOUT;
      }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

    /* Copy left data into temp buffer */
    BL702_MemCpy_Fast((void *)((uint8_t *)shaCtx->shaBuf + left), input, len);
  }

  /* Wait finished */
  timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

  do {
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SHA256 link mode finish to get output function
                                                                                *
                                                                                * @param  shaCtx: SHA256 link mode context pointer
                                                                                * @param  shaNo: SHA ID type
                                                                                * @param  hash: SHA output data of SHA result
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type Sec_Eng_SHA256_Link_Finish(SEC_Eng_SHA256_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, uint8_t *hash) {
  uint32_t last, padn;
  uint32_t high, low;
  uint8_t  msgLen[8];
  uint32_t SHAx = SEC_ENG_BASE;
  uint32_t tmpVal;
  uint32_t shaMode    = (*(uint32_t *)shaCtx->linkAddr) >> 2 & 0x7;
  uint32_t timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));

  /* Wait finished */
  do {
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

  /* Set link address */
  BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_LINK, shaCtx->linkAddr);

