Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
  high = (shaCtx->total[0] >> 29) | (shaCtx->total[1] << 3);
  low  = (shaCtx->total[0] << 3);

  PUT_UINT32_BE(high, msgLen, 0);
  PUT_UINT32_BE(low, msgLen, 4);

  last = shaCtx->total[0] & 0x3F;
  padn = (last < 56) ? (56 - last) : (120 - last);

  Sec_Eng_SHA256_Link_Update(shaCtx, shaNo, (uint8_t *)shaCtx->shaPadding, padn);

  /* Wait for shaPadding idle */
  timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

  do {
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

  Sec_Eng_SHA256_Link_Update(shaCtx, shaNo, msgLen, 8);

  /* Wait finished */
  timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

  do {
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

  /* Get result according to SHA mode,result is placed in (link address + offset:8) */
  switch (shaMode) {
  case 0:
    BL702_MemCpy_Fast(hash, (uint8_t *)(shaCtx->linkAddr + 8), 32);
    break;

  case 1:
    BL702_MemCpy_Fast(hash, (uint8_t *)(shaCtx->linkAddr + 8), 28);
    break;

  case 2:
    BL702_MemCpy_Fast(hash, (uint8_t *)(shaCtx->linkAddr + 8), 20);
    break;

  case 3:
    BL702_MemCpy_Fast(hash, (uint8_t *)(shaCtx->linkAddr + 8), 20);
    break;

  default:
    break;
  }

  /* Choose new hash in the next time */
  *((uint32_t *)shaCtx->linkAddr) &= ~0x40;

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  AES initialization function
                                                                                *
                                                                                * @param  aesCtx: AES context pointer
                                                                                * @param  aesNo: AES ID type
                                                                                * @param  aesType: AES type:ECB,CTR,CBC
                                                                                * @param  keyType: AES key type:128,256,192
                                                                                * @param  enDecType: AES encryption or decryption
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type Sec_Eng_AES_Init(SEC_Eng_AES_Ctx *aesCtx, SEC_ENG_AES_ID_Type aesNo, SEC_ENG_AES_Type aesType, SEC_ENG_AES_Key_Type keyType, SEC_ENG_AES_EnDec_Type enDecType) {
  uint32_t AESx = SEC_ENG_BASE + SEC_ENG_AES_OFFSET;
  uint32_t tmpVal;
  uint32_t timeoutCnt = SEC_ENG_AES_BUSY_TIMEOUT_COUNT;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(aesNo));
  CHECK_PARAM(IS_SEC_ENG_AES_TYPE(aesType));
  CHECK_PARAM(IS_SEC_ENG_AES_KEY_TYPE(keyType));
  CHECK_PARAM(IS_SEC_ENG_AES_ENDEC_TYPE(enDecType));

  /* Wait finished */
  do {
    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_BUSY));

  /* Set AES mode type*/
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_BLOCK_MODE, aesType);

  /* Set AES key type */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_MODE, keyType);

  /* Set AES encryption or decryption */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_DEC_EN, enDecType);

  /* Clear dec_key_sel to select new key */
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_DEC_KEY_SEL);

  /* Clear aes iv sel to select new iv */
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_IV_SEL);

  /* Clear AES interrupt */
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_INT_CLR_1T);

  /* Enable AES */
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_EN);

  BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

  /* Clear AES context */
  memset(aesCtx, 0, sizeof(SEC_Eng_AES_Ctx));

  /* Enable ID0 Access for HW Key */
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL_PROT, 0x03);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(SEC_AES_IRQn, SEC_AES_IRQHandler);
#endif

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  AES enable function,set AES bigendian
                                                                                *
                                                                                * @param  aesNo: AES ID type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_AES_Enable_BE(SEC_ENG_AES_ID_Type aesNo) {
  uint32_t AESx = SEC_ENG_BASE + SEC_ENG_AES_OFFSET;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(aesNo));

  BL_WR_REG(AESx, SEC_ENG_SE_AES_ENDIAN, 0x0f);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(SEC_AES_IRQn, SEC_AES_IRQHandler);
#endif
}

/****************************************************************************/ /**
                                                                                * @brief  AES enable function,set AES littleendian
                                                                                *
                                                                                * @param  aesNo: AES ID type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_AES_Enable_LE(SEC_ENG_AES_ID_Type aesNo) {
  uint32_t AESx = SEC_ENG_BASE + SEC_ENG_AES_OFFSET;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(aesNo));

  BL_WR_REG(AESx, SEC_ENG_SE_AES_ENDIAN, 0x00);

