Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
  /* Set IV */
  BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_3, __REV(BL_RDWD_FRM_BYTEP(iv)));
  iv += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_2, __REV(BL_RDWD_FRM_BYTEP(iv)));
  iv += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_1, __REV(BL_RDWD_FRM_BYTEP(iv)));
  iv += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_0, __REV(BL_RDWD_FRM_BYTEP(iv)));
  iv += 4;

  /* Select hardware key */
  if (keySrc == SEC_ENG_AES_KEY_HW) {
    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_HW_KEY_EN, SEC_ENG_AES_KEY_HW);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_KEY_SEL_0, *key);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_0, tmpVal);

    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_KEY_SEL_1, *key);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_1, tmpVal);

    return;
  }

  BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_7, __REV(BL_RDWD_FRM_BYTEP(key)));
  key += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_6, __REV(BL_RDWD_FRM_BYTEP(key)));
  key += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_5, __REV(BL_RDWD_FRM_BYTEP(key)));
  key += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_4, __REV(BL_RDWD_FRM_BYTEP(key)));
  key += 4;

  tmpVal  = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
  keyType = BL_GET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_MODE);

  if (keyType == (uint32_t)SEC_ENG_AES_KEY_192BITS) {
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_3, __REV(BL_RDWD_FRM_BYTEP(key)));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_2, __REV(BL_RDWD_FRM_BYTEP(key)));
    key += 4;
  } else if (keyType == (uint32_t)SEC_ENG_AES_KEY_256BITS || keyType == (uint32_t)SEC_ENG_AES_DOUBLE_KEY_128BITS) {
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_3, __REV(BL_RDWD_FRM_BYTEP(key)));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_2, __REV(BL_RDWD_FRM_BYTEP(key)));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_1, __REV(BL_RDWD_FRM_BYTEP(key)));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_0, __REV(BL_RDWD_FRM_BYTEP(key)));
    key += 4;
  }

  /* Select software key */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_HW_KEY_EN, SEC_ENG_AES_KEY_SW);

  BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  AES set KEY and IV with bigendian
                                                                                *
                                                                                * @param  aesNo: AES ID type
                                                                                * @param  keySrc: AES KEY type:SEC_ENG_AES_KEY_HW or SEC_ENG_AES_KEY_SW
                                                                                * @param  key: AES KEY pointer
                                                                                * @param  iv: AES IV pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_AES_Set_Key_IV_BE(SEC_ENG_AES_ID_Type aesNo, SEC_ENG_AES_Key_Src_Type keySrc, const uint8_t *key, const uint8_t *iv) {
  uint32_t AESx = SEC_ENG_BASE + SEC_ENG_AES_OFFSET;
  uint32_t tmpVal;
  uint32_t keyType;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(aesNo));
  CHECK_PARAM(IS_SEC_ENG_AES_KEY_SRC_TYPE(keySrc));

  /* Set IV */
  BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_0, BL_RDWD_FRM_BYTEP(iv));
  iv += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_1, BL_RDWD_FRM_BYTEP(iv));
  iv += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_2, BL_RDWD_FRM_BYTEP(iv));
  iv += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_3, BL_RDWD_FRM_BYTEP(iv));
  iv += 4;

  /* Select hardware key */
  if (keySrc == SEC_ENG_AES_KEY_HW) {
    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_HW_KEY_EN, SEC_ENG_AES_KEY_HW);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_KEY_SEL_0, *key);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_0, tmpVal);

    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_KEY_SEL_1, *key);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_1, tmpVal);

    return;
  }

  BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_0, BL_RDWD_FRM_BYTEP(key));
  key += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_1, BL_RDWD_FRM_BYTEP(key));
  key += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_2, BL_RDWD_FRM_BYTEP(key));
  key += 4;
  BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_3, BL_RDWD_FRM_BYTEP(key));
  key += 4;

  tmpVal  = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
  keyType = BL_GET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_MODE);

  if (keyType == (uint32_t)SEC_ENG_AES_KEY_192BITS) {
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_4, BL_RDWD_FRM_BYTEP(key));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_5, BL_RDWD_FRM_BYTEP(key));
    key += 4;
  } else if (keyType == (uint32_t)SEC_ENG_AES_KEY_256BITS || keyType == (uint32_t)SEC_ENG_AES_DOUBLE_KEY_128BITS) {
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_4, BL_RDWD_FRM_BYTEP(key));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_5, BL_RDWD_FRM_BYTEP(key));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_6, BL_RDWD_FRM_BYTEP(key));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_7, BL_RDWD_FRM_BYTEP(key));
    key += 4;
  }

  /* Select software key */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_HW_KEY_EN, SEC_ENG_AES_KEY_SW);

