Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
  BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  AES set counter byte type in CTR mode
                                                                                *
                                                                                * @param  aesNo: AES ID type
                                                                                * @param  counterType: AES counter type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_AES_Set_Counter_Byte(SEC_ENG_AES_ID_Type aesNo, SEC_ENG_AES_Counter_Type counterType) {
  uint32_t AESx = SEC_ENG_BASE;
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(aesNo));
  CHECK_PARAM(IS_SEC_ENG_AES_COUNTER_TYPE(counterType));

  /* Set counter type */
  tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_0_ENDIAN);
  BL_WR_REG(AESx, SEC_ENG_SE_AES_0_ENDIAN, BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_0_CTR_LEN, counterType));
}

/****************************************************************************/ /**
                                                                                * @brief  AES encrypt or decrypt input data
                                                                                *
                                                                                * @param  aesCtx: AES context pointer
                                                                                * @param  aesNo: AES ID type
                                                                                * @param  in: AES input data buffer to deal with
                                                                                * @param  len: AES input data length
                                                                                * @param  out: AES output data buffer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type Sec_Eng_AES_Crypt(SEC_Eng_AES_Ctx *aesCtx, SEC_ENG_AES_ID_Type aesNo, const uint8_t *in, uint32_t len, uint8_t *out) {
  uint32_t AESx = SEC_ENG_BASE + SEC_ENG_AES_OFFSET;
  uint32_t tmpVal;
  uint32_t timeoutCnt = SEC_ENG_AES_BUSY_TIMEOUT_COUNT;

  if (len % 16 != 0) {
    return ERROR;
  }

  /* Wait finished */
  do {
    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_BUSY));

  /* Clear trigger */
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_TRIG_1T);
  BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

  /* Set input and output address */
  BL_WR_REG(AESx, SEC_ENG_SE_AES_MSA, (uint32_t)in);
  BL_WR_REG(AESx, SEC_ENG_SE_AES_MDA, (uint32_t)out);

  /* Set message length */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_MSG_LEN, len / 16);

  if (aesCtx->mode == SEC_ENG_AES_CTR) {
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_DEC_KEY_SEL);
  } else {
    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_DEC_KEY_SEL);
  }

  /* Set IV sel:0 for new, 1 for last */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_IV_SEL, aesCtx->aesFeed);
  BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

  /* Trigger AES Engine */
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_TRIG_1T);
  BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

  /* Wait finished */
  timeoutCnt = SEC_ENG_AES_BUSY_TIMEOUT_COUNT;

  do {
    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_BUSY));

  aesCtx->aesFeed = 1;

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  AES finish function, clean register
                                                                                *
                                                                                * @param  aesNo: AES ID type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type Sec_Eng_AES_Finish(SEC_ENG_AES_ID_Type aesNo) {
  uint32_t AESx = SEC_ENG_BASE + SEC_ENG_AES_OFFSET;
  uint32_t tmpVal;
  uint32_t timeoutCnt = SEC_ENG_AES_BUSY_TIMEOUT_COUNT;

  /* Wait finished */
  do {
    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_BUSY));

  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_EN);

  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_DEC_KEY_SEL);

  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_IV_SEL);

