Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
  BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  TRNG enable TRNG interrupt
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type Sec_Eng_Trng_Enable(void) {
  uint32_t TRNGx = SEC_ENG_BASE + SEC_ENG_TRNG_OFFSET;
  uint32_t tmpVal;
  uint32_t timeoutCnt = SEC_ENG_TRNG_BUSY_TIMEOUT_COUNT;

  tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0);

  /* FIXME:default reseed number is 0x1ff, to verify, use 0xa to speed up */
  // tmpVal=BL_SET_REG_BITS_VAL(tmpVal,SEC_ENG_SE_TRNG_RESEED_N,0x1ff);

  /* No interrupt as default */
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_EN);
  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_INT_CLR_1T);
  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);
  /* busy will be set to 1 after trigger, the gap is 1T */
  __NOP();
  __NOP();
  __NOP();
  __NOP();

  do {
    tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_TRNG_BUSY));

  /* Clear trng interrupt */
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_INT_CLR_1T);
  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(SEC_TRNG_IRQn, SEC_TRNG_IRQHandler);
#endif

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  TRNG enable TRNG interrupt
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_Trng_Int_Enable(void) {
  uint32_t TRNGx = SEC_ENG_BASE + SEC_ENG_TRNG_OFFSET;
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0);

  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_INT_MASK);

  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  TRNG disable TRNG interrupt
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_Trng_Int_Disable(void) {
  uint32_t TRNGx = SEC_ENG_BASE + SEC_ENG_TRNG_OFFSET;
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0);

  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_INT_MASK);

  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  TRNG get random data out
                                                                                *
                                                                                * @param  data[32]: TRNG output data
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type Sec_Eng_Trng_Read(uint8_t data[32]) {
  uint8_t *p     = (uint8_t *)data;
  uint32_t TRNGx = SEC_ENG_BASE + SEC_ENG_TRNG_OFFSET;
  uint32_t tmpVal;
  uint32_t timeoutCnt = SEC_ENG_TRNG_BUSY_TIMEOUT_COUNT;

  tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0);

  /* Trigger */
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_TRIG_1T);
  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);

  /* busy will be set to 1 after trigger, the gap is 1T */
  __NOP();
  __NOP();
  __NOP();
  __NOP();

  do {
    tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_TRNG_BUSY));

  /* copy trng value */
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_0));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_1));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_2));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_3));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_4));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_5));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_6));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_7));
  p += 4;

  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_TRIG_1T);
  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);

  /* Clear data */
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_DOUT_CLR_1T);
  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);

  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_DOUT_CLR_1T);
  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  TRNG get random data out
                                                                                *
                                                                                * @param  data: TRNG output data buffer
                                                                                *
                                                                                * @param  len: total length to get in bytes
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type Sec_Eng_Trng_Get_Random(uint8_t *data, uint32_t len) {
  uint8_t  tmpBuf[32];
  uint32_t readLen = 0;
  uint32_t i = 0, cnt = 0;

  while (readLen < len) {
    if (Sec_Eng_Trng_Read(tmpBuf) != SUCCESS) {
      return -1;
    }

    cnt = len - readLen;

    if (cnt > sizeof(tmpBuf)) {
      cnt = sizeof(tmpBuf);
    }

    for (i = 0; i < cnt; i++) {
      data[readLen + i] = tmpBuf[i];
    }

    readLen += cnt;
  }

