Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
  return 0;
}

/****************************************************************************/ /**
                                                                                * @brief  TRNG Interrupt Read Trigger
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_Trng_Int_Read_Trigger(void) {
  uint32_t TRNGx = SEC_ENG_BASE + SEC_ENG_TRNG_OFFSET;
  uint32_t tmpVal;

  Sec_Eng_Trng_Int_Enable();

  tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0);
  /* Trigger */
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_TRIG_1T);
  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  TRNG get random data out with Interrupt
                                                                                *
                                                                                * @param  data[32]: TRNG output data
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_Trng_Int_Read(uint8_t data[32]) {
  uint8_t *p     = (uint8_t *)data;
  uint32_t TRNGx = SEC_ENG_BASE + SEC_ENG_TRNG_OFFSET;
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0);

  /* copy trng value */
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_0));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_1));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_2));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_3));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_4));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_5));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_6));
  p += 4;
  BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_DOUT_7));
  p += 4;

  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_TRIG_1T);
  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);

  /* Clear data */
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_DOUT_CLR_1T);
  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);

  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_DOUT_CLR_1T);
  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Disable TRNG
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_Trng_Disable(void) {
  uint32_t TRNGx = SEC_ENG_BASE + SEC_ENG_TRNG_OFFSET;
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0);

  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_EN);
  // tmpVal=BL_CLR_REG_BIT(tmpVal,SEC_ENG_SE_TRNG_RESEED_N);
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_INT_CLR_1T);

  BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_CTRL_0, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  PKA Reset
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_Reset(void) {
  uint8_t val;

  // Disable sec engine
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, 0);

  // Enable sec engine
  val = 1 << 3;
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, val);
}

/****************************************************************************/ /**
                                                                                * @brief  PKA Enable big endian
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_BigEndian_Enable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_PKA_0_ENDIAN);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, tmpVal);

