Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(SEC_PKA_IRQn, SEC_PKA_IRQHandler);
#endif
}

/****************************************************************************/ /**
                                                                                * @brief  PKA Enable little endian
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_LittleEndian_Enable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_PKA_0_ENDIAN);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, tmpVal);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(SEC_PKA_IRQn, SEC_PKA_IRQHandler);
#endif
}

/****************************************************************************/ /**
                                                                                * @brief  PKA get status function
                                                                                *
                                                                                * @param  status: Structure pointer of PKA status type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_GetStatus(SEC_Eng_PKA_Status_Type *status) {
  uint32_t tmpVal;

  tmpVal              = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);
  *(uint16_t *)status = (uint16_t)BL_GET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_PKA_0_STATUS);
}

/****************************************************************************/ /**
                                                                                * @brief  PKA clear interrupt
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_Clear_Int(void) {
  uint32_t ctrl;

  ctrl = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);
  ctrl = BL_SET_REG_BIT(ctrl, SEC_ENG_SE_PKA_0_INT_CLR_1T);

  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, ctrl);

  ctrl = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);
  ctrl = BL_CLR_REG_BIT(ctrl, SEC_ENG_SE_PKA_0_INT_CLR_1T);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, ctrl);
}

/****************************************************************************/ /**
                                                                                * @brief  PKA get Register size according to Register type
                                                                                *
                                                                                * @param  reg_type: PKA Register type
                                                                                *
                                                                                * @return Register size
                                                                                *
                                                                                *******************************************************************************/
static uint16_t Sec_Eng_PKA_Get_Reg_Size(SEC_ENG_PKA_REG_SIZE_Type reg_type) {
  switch (reg_type) {
  case SEC_ENG_PKA_REG_SIZE_8:
    return 8;

  case SEC_ENG_PKA_REG_SIZE_16:
    return 16;

  case SEC_ENG_PKA_REG_SIZE_32:
    return 32;

  case SEC_ENG_PKA_REG_SIZE_64:
    return 64;

  case SEC_ENG_PKA_REG_SIZE_96:
    return 96;

  case SEC_ENG_PKA_REG_SIZE_128:
    return 128;

  case SEC_ENG_PKA_REG_SIZE_192:
    return 192;

  case SEC_ENG_PKA_REG_SIZE_256:
    return 256;

  case SEC_ENG_PKA_REG_SIZE_384:
    return 384;

  case SEC_ENG_PKA_REG_SIZE_512:
    return 512;

  default:
    return 0;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA set pre-load register configuration
                                                                                *
                                                                                * @param  size: Data size in word to write
                                                                                * @param  regIndex: Register index
                                                                                * @param  regType: Register type
                                                                                * @param  op: PKA operation
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
static void Sec_Eng_PKA_Write_Pld_Cfg(uint16_t size, uint8_t regIndex, SEC_ENG_PKA_REG_SIZE_Type regType, SEC_ENG_PKA_OP_Type op, uint8_t lastOp) {
  struct pka0_pld_cfg cfg;

  cfg.value.BF.size        = size;
  cfg.value.BF.d_reg_index = regIndex;
  cfg.value.BF.d_reg_type  = regType;
  cfg.value.BF.op          = op;
  cfg.value.BF.last_op     = lastOp;

