Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);
}

/****************************************************************************/ /**
                                                                                * @brief  PKA write common operation first configuration
                                                                                *
                                                                                * @param  s0RegIndex: Register index
                                                                                * @param  s0RegType: Register type
                                                                                * @param  dRegIndex: Result Register index
                                                                                * @param  dRegType: Result Register type
                                                                                * @param  op: PKA operation
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
static void Sec_Eng_PKA_Write_Common_OP_First_Cfg(uint8_t s0RegIndex, uint8_t s0RegType, uint8_t dRegIndex, uint8_t dRegType, uint8_t op, uint8_t lastOp) {
  struct pka0_common_op_first_cfg cfg;

  cfg.value.BF.s0_reg_idx  = s0RegIndex;
  cfg.value.BF.s0_reg_type = s0RegType;

  if (op != SEC_ENG_PKA_OP_LCMP) {
    cfg.value.BF.d_reg_idx  = dRegIndex;
    cfg.value.BF.d_reg_type = dRegType;
  }

  cfg.value.BF.op      = op;
  cfg.value.BF.last_op = lastOp;

  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);
}

/****************************************************************************/ /**
                                                                                * @brief  PKA write common operation second configuration1
                                                                                *
                                                                                * @param  s1RegIndex: Register index
                                                                                * @param  s1RegType: Register type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
static void Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S1(uint8_t s1RegIndex, uint8_t s1RegType) {
  struct pka0_common_op_snd_cfg_S1_only cfg;

  cfg.value.BF.s1_reg_idx  = s1RegIndex;
  cfg.value.BF.s1_reg_type = s1RegType;

  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);
}

/****************************************************************************/ /**
                                                                                * @brief  PKA write common operation second configuration2
                                                                                *
                                                                                * @param  s2RegIndex: Register index
                                                                                * @param  s2RegType: Register type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
static void Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S2(uint8_t s2RegIndex, uint8_t s2RegType) {
  struct pka0_common_op_snd_cfg_S2_only cfg;

  cfg.value.BF.s2_reg_idx  = s2RegIndex;
  cfg.value.BF.s2_reg_type = s2RegType;

  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);
}

/****************************************************************************/ /**
                                                                                * @brief  PKA write common operation second configuration1 and configuration 2
                                                                                *
                                                                                * @param  s1RegIndex: Configuration 1 Register index
                                                                                * @param  s1RegType: Configuration 1 Register type
                                                                                * @param  s2RegIndex: Configuration 2 Register index
                                                                                * @param  s2RegType: Configuration 3 Register type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
static void Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S1_S2(uint8_t s1RegIndex, uint8_t s1RegType, uint8_t s2RegIndex, uint8_t s2RegType) {
  struct pka0_common_op_snd_cfg_S1_S2 cfg;

