Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
  cfg.value.BF.s1_reg_idx  = s1RegIndex;
  cfg.value.BF.s1_reg_type = s1RegType;
  cfg.value.BF.s2_reg_idx  = s2RegIndex;
  cfg.value.BF.s2_reg_type = s2RegType;

  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);
}

/****************************************************************************/ /**
                                                                                * @brief  PKA wait for complete interrupt
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
static BL_Err_Type Sec_Eng_PKA_Wait_ISR(void) {
  uint32_t pka0_ctrl;
  uint32_t timeoutCnt = SEC_ENG_PKA_INT_TIMEOUT_COUNT;

  do {
    pka0_ctrl = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (!BL_GET_REG_BITS_VAL(pka0_ctrl, SEC_ENG_SE_PKA_0_INT));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  PKA read block data from register
                                                                                *
                                                                                * @param  dest: Pointer to buffer address
                                                                                * @param  src: Pointer to register address
                                                                                * @param  len: Data len in word
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifdef ARCH_ARM
#ifndef __GNUC__
__ASM void Sec_Eng_PKA_Read_Block(uint32_t *dest, const uint32_t *src, uint32_t len) {
  PUSH{R3 - R6, LR} Start0 CMP R2, #4 BLT Finish0 LDR R3, [R1] LDR R4, [R1] LDR R5, [R1] LDR R6, [R1] STMIA R0 !, {R3 - R6} SUBS R2, R2, #4 B Start0 Finish0 POP { R3 - R6, PC }
}
#else
void Sec_Eng_PKA_Read_Block(uint32_t *dest, const uint32_t *src, uint32_t len) {
  __asm__ __volatile__("push {r3-r6,lr}\n\t"
                       "Start0 :"
                       "cmp   r2,#4\n\t"
                       "blt   Finish0\n\t"
                       "ldr   r3,[r1]\n\t"
                       "ldr   r4,[r1]\n\t"
                       "ldr   r5,[r1]\n\t"
                       "ldr   r6,[r1]\n\t"
                       "stmia r0!,{r3-r6}\n\t"
                       "sub   r2,r2,#4\n\t"
                       "b     Start0\n\t"
                       "Finish0 :"
                       "pop   {r3-r6,pc}\n\t");
}
#endif
#endif
#ifdef ARCH_RISCV
void Sec_Eng_PKA_Read_Block(uint32_t *dest, const uint32_t *src, uint32_t len) {
  uint32_t wrLen = len - len % 4;
  uint32_t i;

  for (i = 0; i < wrLen; i++) {
    dest[i] = *src;
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  PKA Write block data to register
                                                                                *
                                                                                * @param  dest: Pointer to register address
                                                                                * @param  src: Pointer to buffer address
                                                                                * @param  len: Data len in word
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifdef ARCH_ARM
#ifndef __GNUC__
__ASM void Sec_Eng_PKA_Write_Block(uint32_t *dest, const uint32_t *src, uint32_t len) {
  PUSH{R3 - R6, LR} Start1 CMP R2, #4 BLT Finish1 LDMIA R1 !, {R3 - R6} STR R3, [R0] STR R4, [R0] STR R5, [R0] STR R6, [R0] SUBS R2, R2, #4 B Start1 Finish1 POP { R3 - R6, PC }
}
#else
void Sec_Eng_PKA_Write_Block(uint32_t *dest, const uint32_t *src, uint32_t len) {
  __asm__ __volatile__("push {r3-r6,lr}\n\t"
                       "Start1 :"
                       "cmp   r2,#4\n\t"
                       "blt   Finish1\n\t"
                       "ldmia r1!,{r3-r6}\n\t"
                       "str   r3,[r0]\n\t"
                       "str   r4,[r0]\n\t"
                       "str   r5,[r0]\n\t"
                       "str   r6,[r0]\n\t"
                       "sub   r2,r2,#4\n\t"
                       "b     Start1\n\t"
                       "Finish1 :"
                       "pop   {r3-r6,pc}\n\t");
}
#endif
#endif
#ifdef ARCH_RISCV
void Sec_Eng_PKA_Write_Block(uint32_t *dest, const uint32_t *src, uint32_t len) {
  uint32_t wrLen = len - len % 4;
  uint32_t i;

  for (i = 0; i < wrLen; i++) {
    *dest = src[i];
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  PKA get result
                                                                                *
                                                                                * @param  result: Pointer to store result
                                                                                * @param  retSize: Result length in word
                                                                                * @param  regLen: register length in byte
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
static void Sec_Eng_PKA_Get_Result(uint32_t *result, uint8_t retSize, uint16_t regLen) {
  uint32_t ret_data = 0x00;
  int      index    = 0x00;

  /* Wait for the result */
  Sec_Eng_PKA_Wait_ISR();
  Sec_Eng_PKA_Clear_Int();
  Sec_Eng_PKA_Read_Block(result, (uint32_t *)(SEC_ENG_BASE + SEC_ENG_SE_PKA_0_RW_OFFSET), retSize);
  index = retSize - (retSize % 4);

  while (index < retSize) {
    ret_data      = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW);
    result[index] = ret_data;
    index++;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA load data to register
                                                                                *
                                                                                * @param  regType: Register type
                                                                                * @param  regIndex: Register index
                                                                                * @param  data: Data buffer
                                                                                * @param  size: Data length in word
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_Type regType, uint8_t regIndex, const uint32_t *data, uint16_t size, uint8_t lastOp) {
  int      index  = 0x00;
  uint16_t regLen = Sec_Eng_PKA_Get_Reg_Size(regType);

