Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
  Sec_Eng_PKA_Write_Pld_Cfg(size, regIndex, regType, SEC_ENG_PKA_OP_CTLIR_PLD, lastOp);

  if (size > regLen / 4) {
    size = regLen / 4;
  }

  Sec_Eng_PKA_Write_Block((uint32_t *)(SEC_ENG_BASE + SEC_ENG_SE_PKA_0_RW_OFFSET), data, size);
  index = size - (size % 4);

  while (index < size) {
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, data[index]);
    index++;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA read data from register
                                                                                *
                                                                                * @param  regType: Register type
                                                                                * @param  regIdx: Register index
                                                                                * @param  result: Data buffer
                                                                                * @param  retSize: Data length in word
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_Read_Data(SEC_ENG_PKA_REG_SIZE_Type regType, uint8_t regIdx, uint32_t *result, uint8_t retSize) {
  uint16_t regSize;
  uint32_t dummyData = 0;

  regSize = Sec_Eng_PKA_Get_Reg_Size(regType);

  if (retSize > regSize / 4) {
    result = NULL;
    return;
  }

  Sec_Eng_PKA_Write_Pld_Cfg(retSize, regIdx, regType, SEC_ENG_PKA_OP_CFLIR_BUFFER, 1);

  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, dummyData);

  Sec_Eng_PKA_Get_Result(result, retSize, regSize);
}

/****************************************************************************/ /**
                                                                                * @brief  PKA clear register
                                                                                *
                                                                                * @param  dRegType: Register type
                                                                                * @param  dRegIdx: Register index
                                                                                * @param  size: Data length in word
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_Type dRegType, uint8_t dRegIdx, uint8_t size, uint8_t lastOp) {
  uint32_t dummyData = 0;

  Sec_Eng_PKA_Write_Pld_Cfg(size, dRegIdx, dRegType, SEC_ENG_PKA_OP_CLIR, lastOp);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, dummyData);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA load data to register
                                                                                *
                                                                                * @param  regType: regType: Register type
                                                                                * @param  regIndex: regIndex: Register index
                                                                                * @param  data: data: Data buffer
                                                                                * @param  lastOp: size: Data length in word
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_Write_Immediate(SEC_ENG_PKA_REG_SIZE_Type regType, uint8_t regIndex, uint32_t data, uint8_t lastOp) {
  struct pka0_pldi_cfg cfg;

  cfg.value.BF.rsvd        = 0;
  cfg.value.BF.d_reg_index = regIndex;
  cfg.value.BF.d_reg_type  = regType;
  cfg.value.BF.op          = SEC_ENG_PKA_OP_SLIR;
  cfg.value.BF.last_op     = lastOp;

  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, data);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA negative source data:D = (1 << SIZE{S0})-S0
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source Register type
                                                                                * @param  s0RegIdx: Source Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_NREG(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t lastOp) {
  uint32_t dummyData = 0;

