Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_NLIR, lastOp);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, dummyData);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA move data:D = S0
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source Register type
                                                                                * @param  s0RegIdx: Source Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_Move_Data(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t lastOp) {
  uint32_t dummyData = 0;

  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_MOVDAT, lastOp);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, dummyData);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA resize data:D = S0, D.Size = S0.Size
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source Register type
                                                                                * @param  s0RegIdx: Source Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_RESIZE(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t lastOp) {
  uint32_t dummyData = 0;

  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_RESIZE, lastOp);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, dummyData);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA mod add:D = (S0 + S1) mod S2
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s1RegType: Source 1 Register type
                                                                                * @param  s1RegIdx: Source 1 Register index
                                                                                * @param  s2RegType: Source 2 Register type
                                                                                * @param  s2RegIdx: Source 2 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_MADD(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s1RegType, uint8_t s1RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp) {
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_MADD, lastOp);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S1_S2(s1RegIdx, s1RegType, s2RegIdx, s2RegType);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA mod sub:D = (S0 - S1) mod S2
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s1RegType: Source 1 Register type
                                                                                * @param  s1RegIdx: Source 1 Register index
                                                                                * @param  s2RegType: Source 2 Register type
                                                                                * @param  s2RegIdx: Source 2 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_MSUB(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s1RegType, uint8_t s1RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp) {
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_MSUB, lastOp);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S1_S2(s1RegIdx, s1RegType, s2RegIdx, s2RegType);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA mod :D = S0 mod S2
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s2RegType: Source 2 Register type
                                                                                * @param  s2RegIdx: Source 2 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_MREM(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp) {
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_MREM, lastOp);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S2(s2RegIdx, s2RegType);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA mod mul:D = (S0 * S1) mod S2
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s1RegType: Source 1 Register type
                                                                                * @param  s1RegIdx: Source 1 Register index
                                                                                * @param  s2RegType: Source 2 Register type
                                                                                * @param  s2RegIdx: Source 2 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_MMUL(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s1RegType, uint8_t s1RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp) {
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_MMUL, lastOp);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S1_S2(s1RegIdx, s1RegType, s2RegIdx, s2RegType);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA mod sqr:D = (S0 ^ 2) mod S2
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s2RegType: Source 2 Register type
                                                                                * @param  s2RegIdx: Source 2 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_MSQR(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp) {
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_MSQR, lastOp);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S2(s2RegIdx, s2RegType);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA mod exp:D = (S0 ^ S1) mod S2
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s1RegType: Source 1 Register type
                                                                                * @param  s1RegIdx: Source 1 Register index
                                                                                * @param  s2RegType: Source 2 Register type
                                                                                * @param  s2RegIdx: Source 2 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_MEXP(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s1RegType, uint8_t s1RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp) {
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_MEXP, lastOp);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S1_S2(s1RegIdx, s1RegType, s2RegIdx, s2RegType);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA mod exp:D = (S0 ^ (S2-2) ) mod S2
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s2RegType: Source 2 Register type
                                                                                * @param  s2RegIdx: Source 2 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_MINV(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp) {
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_MINV, lastOp);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S2(s2RegIdx, s2RegType);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA Report COUT to 1 when S0 < S1
                                                                                *
                                                                                * @param  cout: Compare result
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s1RegType: Source 1 Register type
                                                                                * @param  s1RegIdx: Source 1 Register index
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_LCMP(uint8_t *cout, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s1RegType, uint8_t s1RegIdx) {
  uint32_t pka0_ctrl = 0x00;

  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, 0, 0, SEC_ENG_PKA_OP_LCMP, 1);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S1(s1RegIdx, s1RegType);

  Sec_Eng_PKA_Wait_ISR();
  Sec_Eng_PKA_Clear_Int();
  pka0_ctrl = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);

  *cout = (pka0_ctrl & SEC_ENG_PKA_STATUS_LAST_OPC_MASK) >> SEC_ENG_PKA_STATUS_LAST_OPC_OFFSET;
}

/****************************************************************************/ /**
                                                                                * @brief  PKA add:D = S0 + S1
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s1RegType: Source 1 Register type
                                                                                * @param  s1RegIdx: Source 1 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_LADD(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s1RegType, uint8_t s1RegIdx, uint8_t lastOp) {
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_LADD, lastOp);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S1(s1RegIdx, s1RegType);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

