Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
/****************************************************************************/ /**
                                                                                * @brief  PKA sub:D = S0 - S1
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s1RegType: Source 1 Register type
                                                                                * @param  s1RegIdx: Source 1 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_LSUB(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s1RegType, uint8_t s1RegIdx, uint8_t lastOp) {
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_LSUB, lastOp);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S1(s1RegIdx, s1RegType);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA mul:D = S0 * S1
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s1RegType: Source 1 Register type
                                                                                * @param  s1RegIdx: Source 1 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_LMUL(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s1RegType, uint8_t s1RegIdx, uint8_t lastOp) {
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_LMUL, lastOp);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S1(s1RegIdx, s1RegType);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA sqr:D = S0^2
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_LSQR(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t lastOp) {
  uint32_t dummyData = 0;

  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_LSQR, lastOp);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, dummyData);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA div:D = S0 / S2
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  s2RegType: Source 2 Register type
                                                                                * @param  s2RegIdx: Source 2 Register index
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_LDIV(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp) {
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_LDIV, lastOp);
  Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S2(s2RegIdx, s2RegType);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA shift:D = S0 << BIT SHIFT
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  bit_shift: Bits to shift
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_LMUL2N(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint16_t bit_shift, uint8_t lastOp) {
  struct pka0_bit_shift_op_cfg cfg;

