Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_LMUL2N, 0);

  cfg.value.BF.bit_shift = bit_shift;
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA shift:D = S0 >> BIT SHIFT
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  bit_shift: Bits to shift
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_LDIV2N(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint16_t bit_shift, uint8_t lastOp) {
  struct pka0_bit_shift_op_cfg cfg;

  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_LDIV2N, 0);

  cfg.value.BF.bit_shift = bit_shift;
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA mod 2N:D = S0 % ((1 << BIT SHIFT)-1)
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  s0RegType: Source 0 Register type
                                                                                * @param  s0RegIdx: Source 0 Register index
                                                                                * @param  bit_shift: Bits to shift
                                                                                * @param  lastOp: Last operation
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_LMOD2N(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint16_t bit_shift, uint8_t lastOp) {
  struct pka0_bit_shift_op_cfg cfg;

  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_MOD2N, lastOp);

  cfg.value.BF.bit_shift = bit_shift;
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);

  if (lastOp) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
  }
}

/****************************************************************************/ /**
                                                                                * @brief  PKA GF to Mont  filed 2N:d = (a<<size) % p
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  sRegType: Source Register type
                                                                                * @param  sRegIdx: Source Register index
                                                                                * @param  size: Bits to shift
                                                                                * @param  tRegType: Temp Register type
                                                                                * @param  tRegIdx: Temp Register index
                                                                                * @param  pRegType: Mod P Register type
                                                                                * @param  pRegIdx: Mod P Register index
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_GF2Mont(uint8_t dRegType, uint8_t dRegIdx, uint8_t sRegType, uint8_t sRegIdx, uint32_t size, uint8_t tRegType, uint8_t tRegIdx, uint8_t pRegType, uint8_t pRegIdx) {
  Sec_Eng_PKA_LMUL2N(tRegType, tRegIdx, sRegType, sRegIdx, size, 0);
  Sec_Eng_PKA_MREM(dRegType, dRegIdx, tRegType, tRegIdx, pRegType, pRegIdx, 1);
}

/****************************************************************************/ /**
                                                                                * @brief  PKA GF to Mont  filed 2N:d = (a * inv_r) % p
                                                                                *
                                                                                * @param  dRegType: Destination Register type
                                                                                * @param  dRegIdx: Destination Register index
                                                                                * @param  aRegType: Source Register type
                                                                                * @param  aRegIdx: Source Register index
                                                                                * @param  invrRegType: Invert R Register type
                                                                                * @param  invrRegIdx: Invert R Register index
                                                                                * @param  tRegType: Temp Register type
                                                                                * @param  tRegIdx: Temp Register index
                                                                                * @param  pRegType: Mod P Register type
                                                                                * @param  pRegIdx: Mod P Register index
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_PKA_Mont2GF(uint8_t dRegType, uint8_t dRegIdx, uint8_t aRegType, uint8_t aRegIdx, uint8_t invrRegType, uint8_t invrRegIdx, uint8_t tRegType, uint8_t tRegIdx, uint8_t pRegType,
                         uint8_t pRegIdx) {
  Sec_Eng_PKA_LMUL(tRegType, tRegIdx, aRegType, aRegIdx, invrRegType, invrRegIdx, 0);
  Sec_Eng_PKA_MREM(dRegType, dRegIdx, tRegType, tRegIdx, pRegType, pRegIdx, 1);
}

/****************************************************************************/ /**
                                                                                * @brief  Set gmac little endian
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_GMAC_Enable_LE(void) {
  uint32_t tmpVal;

