Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
  tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_T_ENDIAN);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_H_ENDIAN);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_X_ENDIAN);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0, tmpVal);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(SEC_GMAC_IRQn, SEC_GMAC_IRQHandler);
#endif
}

/****************************************************************************/ /**
                                                                                * @brief  Set gmac big endian
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_GMAC_Enable_BE(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0);
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_T_ENDIAN);
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_H_ENDIAN);
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_X_ENDIAN);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0, tmpVal);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(SEC_GMAC_IRQn, SEC_GMAC_IRQHandler);
#endif
}

/****************************************************************************/ /**
                                                                                * @brief  GMAC enable link mode
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_GMAC_Enable_Link(void) {
  uint32_t tmpVal;

  /* Enable gmac link mode */
  tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_EN));
}

/****************************************************************************/ /**
                                                                                * @brief  GMAC disable link mode
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void Sec_Eng_GMAC_Disable_Link(void) {
  uint32_t tmpVal;

  /* Disable gmac link mode */
  tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_EN));
}

/****************************************************************************/ /**
                                                                                * @brief  GMAC work in link mode
                                                                                *
                                                                                * @param  linkAddr: Address of config structure in link mode
                                                                                * @param  in: GMAC input data buffer to deal with
                                                                                * @param  len: GMAC input data length
                                                                                * @param  out: GMAC output data buffer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type Sec_Eng_GMAC_Link_Work(uint32_t linkAddr, const uint8_t *in, uint32_t len, uint8_t *out) {
  uint32_t GMACx = SEC_ENG_BASE;
  uint32_t tmpVal;
  uint32_t timeoutCnt = SEC_ENG_GMAC_BUSY_TIMEOUT_COUNT;

  /* Link address should word align */
  if ((linkAddr & 0x03) != 0 || len % 16 != 0) {
    return ERROR;
  }

  /* Wait finished */
  do {
    tmpVal = BL_RD_REG(GMACx, SEC_ENG_SE_GMAC_0_CTRL_0);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_GMAC_0_BUSY));

  /* Set link address */
  BL_WR_REG(GMACx, SEC_ENG_SE_GMAC_0_LCA, linkAddr);

  /* Change source buffer address */
  *(uint32_t *)(linkAddr + 4) = (uint32_t)in;

  /* Set data length */
  *((uint16_t *)linkAddr + 1) = len / 16;

  /* Start gmac engine and wait finishing */
  tmpVal = BL_RD_REG(GMACx, SEC_ENG_SE_GMAC_0_CTRL_0);
  BL_WR_REG(GMACx, SEC_ENG_SE_GMAC_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_TRIG_1T));
  timeoutCnt = SEC_ENG_GMAC_BUSY_TIMEOUT_COUNT;

  do {
    tmpVal = BL_RD_REG(GMACx, SEC_ENG_SE_GMAC_0_CTRL_0);
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_GMAC_0_BUSY));

  /* Get result */
  BL702_MemCpy_Fast(out, (uint8_t *)(linkAddr + 0x18), 16);

  return SUCCESS;
}
#ifndef BFLB_USE_HAL_DRIVER

/****************************************************************************/ /**
                                                                                * @brief  Sec Eng Interrupt Handler
                                                                                *
                                                                                * @param  intType: IRQ Type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
static void SEC_Eng_IntHandler(SEC_ENG_INT_Type intType) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_INT_TYPE(intType));

  switch (intType) {
  case SEC_ENG_INT_TRNG:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0);

    if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_TRNG_0_INT)) {
      /* Clear interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_INT_CLR_1T));

