Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
      /* Call the callback function */
      if (secEngIntCbfArra[SEC_ENG_INT_TRNG] != NULL) {
        secEngIntCbfArra[SEC_ENG_INT_TRNG]();
      }
    }

    break;

  case SEC_ENG_INT_AES:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL);

    if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_0_INT)) {
      /* Clear interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_0_INT_CLR_1T));

      /* Call the callback function */
      if (secEngIntCbfArra[SEC_ENG_INT_AES] != NULL) {
        secEngIntCbfArra[SEC_ENG_INT_AES]();
      }
    }

    break;

  case SEC_ENG_INT_SHA:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL);

    if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_INT)) {
      /* Clear interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_INT_CLR_1T));

      /* Call the callback function */
      if (secEngIntCbfArra[SEC_ENG_INT_SHA] != NULL) {
        secEngIntCbfArra[SEC_ENG_INT_SHA]();
      }
    }

    break;

  case SEC_ENG_INT_PKA:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);

    if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_PKA_0_INT)) {
      /* Clear interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_PKA_0_INT_CLR_1T));

      /* Call the callback function */
      if (secEngIntCbfArra[SEC_ENG_INT_PKA] != NULL) {
        secEngIntCbfArra[SEC_ENG_INT_PKA]();
      }
    }

    break;

  case SEC_ENG_INT_CDET:

    /* Call the callback function */
    if (secEngIntCbfArra[SEC_ENG_INT_CDET] != NULL) {
      secEngIntCbfArra[SEC_ENG_INT_CDET]();
    }

    break;

  case SEC_ENG_INT_GMAC:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0);

    if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_GMAC_0_INT)) {
      /* Clear interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_INT_CLR_1T));

      /* Call the callback function */
      if (secEngIntCbfArra[SEC_ENG_INT_GMAC] != NULL) {
        secEngIntCbfArra[SEC_ENG_INT_GMAC]();
      }
    }

    break;

  default:
    break;
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Sec Eng Interrupt Mask or Unmask
                                                                                *
                                                                                * @param  intType: Sec Eng Interrupt Type
                                                                                * @param  intMask: MASK or UNMASK
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void SEC_Eng_IntMask(SEC_ENG_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_INT_TYPE(intType));

  switch (intType) {
  case SEC_ENG_INT_TRNG:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0);

    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_INT_MASK));
    } else {
      /* MASK(Disable) this interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_INT_MASK));
    }

    break;

  case SEC_ENG_INT_AES:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL);

    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_0_INT_MASK));
    } else {
      /* MASK(Disable) this interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_0_INT_MASK));
    }

    break;

  case SEC_ENG_INT_SHA:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL);

    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_INT_MASK));
    } else {
      /* MASK(Disable) this interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_INT_MASK));
    }

    break;

  case SEC_ENG_INT_PKA:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);

    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_PKA_0_INT_MASK));
    } else {
      /* MASK(Disable) this interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_PKA_0_INT_MASK));
    }

    break;

  case SEC_ENG_INT_CDET:
    break;

  case SEC_ENG_INT_GMAC:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0);

    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_INT_MASK));
    } else {
      /* MASK(Disable) this interrupt */
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_INT_MASK));
    }

    break;

  case SEC_ENG_INT_ALL:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0);
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_INT_MASK));
      tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL);
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_0_INT_MASK));
      tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL);
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_INT_MASK));
      tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_PKA_0_INT_MASK));
      tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0);
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_INT_MASK));
    } else {
      /* MASK(Disable) this interrupt */
      tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0);
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_INT_MASK));
      tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL);
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_0_INT_MASK));
      tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL);
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_INT_MASK));
      tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_PKA_0_INT_MASK));
      tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0);
      BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_INT_MASK));
    }

    break;

  default:
    break;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  Sec Eng Interrupt clear
                                                                                *
                                                                                * @param  intType: Sec Eng Interrupt Type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void SEC_Eng_ClrIntStatus(SEC_ENG_INT_Type intType) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_INT_TYPE(intType));

  switch (intType) {
  case SEC_ENG_INT_AES:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL);
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_0_INT_CLR_1T));
    break;

  case SEC_ENG_INT_SHA:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL);
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_INT_CLR_1T));
    break;

  case SEC_ENG_INT_TRNG:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0);
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_INT_CLR_1T));
    break;

  case SEC_ENG_INT_PKA:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_PKA_0_INT_CLR_1T));
    break;

  case SEC_ENG_INT_CDET:
    break;

  case SEC_ENG_INT_GMAC:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0);
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_GMAC_0_INT_CLR_1T));
    break;

  default:
    break;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  Sec Eng Interrupt callback function install
                                                                                *
                                                                                * @param  intType: Sec Eng Interrupt Type
                                                                                * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void SEC_Eng_Int_Callback_Install(SEC_ENG_INT_Type intType, intCallback_Type *cbFun) {
  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_INT_TYPE(intType));

  secEngIntCbfArra[intType] = cbFun;
}

/****************************************************************************/ /**
                                                                                * @brief  Sec Eng get interrupt status
                                                                                *
                                                                                * @param  intType: Sec Eng Interrupt Type
                                                                                *
                                                                                * @return status of interrupt
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type SEC_Eng_GetIntStatus(SEC_ENG_INT_Type intType) {
  uint32_t    tmpVal;
  BL_Sts_Type status = RESET;

  /* Check the parameters */
  CHECK_PARAM(IS_SEC_ENG_INT_TYPE(intType));

  switch (intType) {
  case SEC_ENG_INT_AES:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL);

