Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sec_eng.c
    if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_0_INT)) {
      status = SET;
    }

    break;

  case SEC_ENG_INT_SHA:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL);

    if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_INT)) {
      status = SET;
    }

    break;

  case SEC_ENG_INT_TRNG:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0);

    if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_TRNG_0_INT)) {
      status = SET;
    }

    break;

  case SEC_ENG_INT_PKA:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);

    if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_PKA_0_INT)) {
      status = SET;
    }

    break;

  case SEC_ENG_INT_CDET:
    break;

  case SEC_ENG_INT_GMAC:
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0);

    if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_GMAC_0_INT)) {
      status = SET;
    }

    break;

  default:
    break;
  }

  return status;
}
#ifndef BFLB_USE_HAL_DRIVER

/****************************************************************************/ /**
                                                                                * @brief  Sec Eng Trng IRQ Handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void SEC_TRNG_IRQHandler(void) { SEC_Eng_IntHandler(SEC_ENG_INT_TRNG); }

/****************************************************************************/ /**
                                                                                * @brief  Sec Eng Pka IRQ Handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void SEC_PKA_IRQHandler(void) { SEC_Eng_IntHandler(SEC_ENG_INT_PKA); }

/****************************************************************************/ /**
                                                                                * @brief  Sec Eng Aes IRQ Handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void SEC_AES_IRQHandler(void) { SEC_Eng_IntHandler(SEC_ENG_INT_AES); }

/****************************************************************************/ /**
                                                                                * @brief  Sec Eng Sha IRQ Handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void SEC_SHA_IRQHandler(void) { SEC_Eng_IntHandler(SEC_ENG_INT_SHA); }

/****************************************************************************/ /**
                                                                                * @brief  Sec Eng Cdet IRQ Handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void SEC_CDET_IRQHandler(void) { SEC_Eng_IntHandler(SEC_ENG_INT_CDET); }

/****************************************************************************/ /**
                                                                                * @brief  Sec Eng Gmac IRQ Handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void SEC_GMAC_IRQHandler(void) { SEC_Eng_IntHandler(SEC_ENG_INT_GMAC); }
#endif

/****************************************************************************/ /**
                                                                                * @brief  turn on sec ring
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ATTR_TCM_SECTION SEC_Eng_Turn_On_Sec_Ring(void) {
  uint32_t tmpVal = 0;

  /* Turn-on Sec Ring Oscillation */
  tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_3);
  tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_ROSC_EN);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_3, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  turn off sec ring
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ATTR_TCM_SECTION SEC_Eng_Turn_Off_Sec_Ring(void) {
  uint32_t tmpVal = 0;

  /* Turn-off Sec Ring Oscillation */
  tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_3);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_ROSC_EN);
  BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_3, tmpVal);
}

/*@} end of group SEC_ENG_Public_Functions */

/*@} end of group SEC_ENG */

/*@} end of group BL702_Peripheral_Driver */
